; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.1 = type { [1 x i32]*, [32 x i32]*, %struct.flow_id*, %struct.tcp_md* }
%struct.flow_id = type { i32, i16, i32, i16 }
%struct.tcp_md = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.2 = type { [2 x i32]*, [5 x i32]*, i32*, %struct.packet_event* }
%struct.packet_event = type { %struct.flow_id*, i32, i32 }
%struct.anon.3 = type { [1 x i32]*, %struct.flow_id*, %struct.map_elem*, [5 x i32]* }
%struct.map_elem = type { %struct.flow_id*, i32, %struct.bpf_timer }
%struct.bpf_timer = type { i128 }
%struct.anon.4 = type { [1 x i32]*, %struct.flow_id*, %struct.timeout_event*, [1000 x i32]* }
%struct.timeout_event = type { %struct.flow_id*, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.event = type { i8, i8* }
%struct.net_event = type { %struct.flow_id*, i32 }
%struct.app_event = type { %struct.flow_id*, i32 }

@simply_drop.____fmt = internal constant [3 x i8] c"%d\00", align 1, !dbg !0
@simply_drop.____fmt.1 = internal constant [7 x i8] c"ID: %u\00", align 1, !dbg !47

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 338, type: !503, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "simply_drop", scope: !3, file: !3, line: 332, type: !4, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !415)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processor", checksumkind: CSK_MD5, checksum: "b9d2f7df6d7ffb29b15619f42fd0ceac")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !9, line: 5442, size: 192, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "5ad8bc925dae1ec87bbb04b3148b183b")
!10 = !{!11, !15, !16, !17, !18, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 5443, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 5444, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 5445, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 5447, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !8, file: !9, line: 5448, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !8, file: !9, line: 5450, baseType: !12, size: 32, offset: 160)
!20 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !41, globals: !46, splitDebugInlining: false, nameTableKind: None)
!21 = !{!22, !29, !35}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !9, line: 5431, baseType: !14, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!25 = !DIEnumerator(name: "XDP_DROP", value: 1)
!26 = !DIEnumerator(name: "XDP_PASS", value: 2)
!27 = !DIEnumerator(name: "XDP_TX", value: 3)
!28 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 1168, baseType: !14, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "BPF_ANY", value: 0)
!32 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!33 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!34 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event_type", file: !3, line: 19, baseType: !14, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "APP_EVENT", value: 0)
!38 = !DIEnumerator(name: "PACKET_EVENT", value: 1)
!39 = !DIEnumerator(name: "NET_EVENT", value: 2)
!40 = !DIEnumerator(name: "TIMEOUT_EVENT", value: 3)
!41 = !{!42, !43, !44, !12}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !45)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !{!0, !47, !54, !59, !64, !69, !103, !126, !142, !159, !165, !171, !178, !185, !217, !235, !240, !245, !250, !255, !257, !262, !267, !277, !290, !295, !305, !311, !316, !327, !329, !334, !346, !351, !356, !361, !363, !365, !367, !372, !380, !389, !394, !396, !411, !413}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 369, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 56, elements: !52)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !{!53}
!53 = !DISubrange(count: 7)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 413, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 288, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 36)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 417, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 224, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 28)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "_license", scope: !20, file: !3, line: 442, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 4)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "tcp_connections", scope: !20, file: !3, line: 58, type: !71, isLocal: false, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 52, size: 256, elements: !72)
!72 = !{!73, !78, !83, !92}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !3, line: 54, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !71, file: !3, line: 55, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !71, file: !3, line: 56, baseType: !84, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_id", file: !86, line: 3, size: 128, elements: !87)
!86 = !DIFile(filename: "./common.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processor", checksumkind: CSK_MD5, checksum: "23119144d5fc7b4eabbc877082e69c73")
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sender_ip", scope: !85, file: !86, line: 4, baseType: !12, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sender_port", scope: !85, file: !86, line: 5, baseType: !44, size: 16, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_ip", scope: !85, file: !86, line: 6, baseType: !12, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_port", scope: !85, file: !86, line: 7, baseType: !44, size: 16, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !71, file: !3, line: 57, baseType: !93, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_md", file: !86, line: 10, size: 224, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "segment_size", scope: !94, file: !86, line: 12, baseType: !12, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !94, file: !86, line: 14, baseType: !12, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "window_start_seq", scope: !94, file: !86, line: 16, baseType: !12, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "last_seq_sent", scope: !94, file: !86, line: 18, baseType: !12, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !94, file: !86, line: 22, baseType: !12, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cur_size", scope: !94, file: !86, line: 24, baseType: !12, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !94, file: !86, line: 27, baseType: !12, size: 32, offset: 192)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "window_packets", scope: !20, file: !3, line: 66, type: !105, isLocal: false, isDefinition: true)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 60, size: 256, elements: !106)
!106 = !{!107, !112, !117, !119}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !3, line: 62, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !105, file: !3, line: 63, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 5)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !105, file: !3, line: 64, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !3, line: 65, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_event", file: !3, line: 36, size: 128, elements: !122)
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !121, file: !3, line: 37, baseType: !84, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !121, file: !3, line: 38, baseType: !6, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !3, line: 39, baseType: !12, size: 32, offset: 96)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "timer_array", scope: !20, file: !3, line: 79, type: !128, isLocal: false, isDefinition: true)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 74, size: 256, elements: !129)
!129 = !{!130, !131, !132, !141}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !3, line: 75, baseType: !74, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !128, file: !3, line: 76, baseType: !84, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !128, file: !3, line: 77, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_elem", file: !3, line: 68, size: 256, elements: !135)
!135 = !{!136, !137, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !134, file: !3, line: 69, baseType: !84, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !134, file: !3, line: 70, baseType: !6, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !134, file: !3, line: 71, baseType: !139, size: 128, align: 64, offset: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_timer", file: !9, line: 6185, size: 128, align: 64, elements: !140)
!140 = !{}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !128, file: !3, line: 78, baseType: !113, size: 64, offset: 192)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "timeout_array", scope: !20, file: !3, line: 86, type: !144, isLocal: false, isDefinition: true)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 81, size: 256, elements: !145)
!145 = !{!146, !147, !148, !154}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !3, line: 82, baseType: !74, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !144, file: !3, line: 83, baseType: !84, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !144, file: !3, line: 84, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeout_event", file: !3, line: 42, size: 128, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !150, file: !3, line: 43, baseType: !84, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !150, file: !3, line: 44, baseType: !6, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !144, file: !3, line: 85, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32000, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 1000)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !20, file: !161, line: 206, type: !162, isLocal: true, isDefinition: true)
!161 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processor", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!12}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !20, file: !161, line: 177, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!43, !170, !12, null}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !20, file: !161, line: 56, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!42, !42, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !20, file: !161, line: 78, type: !180, isLocal: true, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!43, !42, !176, !176, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !184)
!184 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "____fmt", scope: !187, file: !3, line: 294, type: !214, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "dispatcher", scope: !3, file: !3, line: 281, type: !188, scopeLine: 281, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !197)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !3, line: 47, size: 128, elements: !192)
!192 = !{!193, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !3, line: 48, baseType: !194, size: 8)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !195)
!195 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "event_data", scope: !191, file: !3, line: 49, baseType: !42, size: 64, offset: 64)
!197 = !{!198, !199, !207}
!198 = !DILocalVariable(name: "event", arg: 1, scope: !187, file: !3, line: 281, type: !190)
!199 = !DILocalVariable(name: "ae", scope: !200, file: !3, line: 284, type: !202)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 283, column: 25)
!201 = distinct !DILexicalBlock(scope: !187, file: !3, line: 282, column: 26)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_event", file: !3, line: 26, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !203, file: !3, line: 27, baseType: !84, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !3, line: 28, baseType: !12, size: 32, offset: 64)
!207 = !DILocalVariable(name: "ne", scope: !208, file: !3, line: 289, type: !209)
!208 = distinct !DILexicalBlock(scope: !201, file: !3, line: 288, column: 25)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_event", file: !3, line: 31, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !210, file: !3, line: 32, baseType: !84, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !210, file: !3, line: 33, baseType: !12, size: 32, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 24)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 173, type: !232, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "app_event_processor", scope: !3, file: !3, line: 169, type: !220, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !202}
!222 = !{!223, !224, !225, !226, !227, !228, !231}
!223 = !DILocalVariable(name: "ae", arg: 1, scope: !219, file: !3, line: 169, type: !202)
!224 = !DILocalVariable(name: "tcp_ctx", scope: !219, file: !3, line: 171, type: !93)
!225 = !DILocalVariable(name: "data_rest", scope: !219, file: !3, line: 176, type: !6)
!226 = !DILocalVariable(name: "num_to_send", scope: !219, file: !3, line: 177, type: !6)
!227 = !DILocalVariable(name: "map_entry", scope: !219, file: !3, line: 181, type: !133)
!228 = !DILocalVariable(name: "me", scope: !229, file: !3, line: 184, type: !134)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 182, column: 21)
!230 = distinct !DILexicalBlock(scope: !219, file: !3, line: 182, column: 9)
!231 = !DILocalVariable(name: "i", scope: !219, file: !3, line: 195, type: !43)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 304, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 38)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 183, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 264, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 33)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 189, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 216, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 27)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 197, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 152, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 19)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 201, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 232, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 29)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 206, type: !247, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 210, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 208, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 26)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "bpf_loop", scope: !20, file: !161, line: 4216, type: !264, isLocal: true, isDefinition: true)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !12, !42, !42, !183}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "____fmt", scope: !269, file: !3, line: 155, type: !232, isLocal: true, isDefinition: true)
!269 = distinct !DISubprogram(name: "app_event_send", scope: !3, file: !3, line: 152, type: !270, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{!43, !12, !84}
!272 = !{!273, !274, !275, !276}
!273 = !DILocalVariable(name: "index", arg: 1, scope: !269, file: !3, line: 152, type: !12)
!274 = !DILocalVariable(name: "fid", arg: 2, scope: !269, file: !3, line: 152, type: !84)
!275 = !DILocalVariable(name: "tcp_ctx", scope: !269, file: !3, line: 153, type: !93)
!276 = !DILocalVariable(name: "pe", scope: !269, file: !3, line: 158, type: !121)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "____fmt", scope: !279, file: !3, line: 97, type: !287, isLocal: true, isDefinition: true)
!279 = distinct !DISubprogram(name: "enque", scope: !3, file: !3, line: 94, type: !280, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !282)
!280 = !DISubroutineType(types: !281)
!281 = !{!6, !120, !84}
!282 = !{!283, !284, !285, !286}
!283 = !DILocalVariable(name: "pe", arg: 1, scope: !279, file: !3, line: 94, type: !120)
!284 = !DILocalVariable(name: "fid", arg: 2, scope: !279, file: !3, line: 94, type: !84)
!285 = !DILocalVariable(name: "tcp_ctx", scope: !279, file: !3, line: 95, type: !93)
!286 = !DILocalVariable(name: "key", scope: !279, file: !3, line: 107, type: !12)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 296, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 37)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "____fmt", scope: !279, file: !3, line: 102, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 47)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "____fmt", scope: !297, file: !3, line: 90, type: !302, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "send_packet", scope: !3, file: !3, line: 88, type: !298, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!6, !120}
!300 = !{!301}
!301 = !DILocalVariable(name: "pe", arg: 1, scope: !297, file: !3, line: 88, type: !120)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 16)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "bpf_timer_init", scope: !20, file: !161, line: 3992, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!43, !310, !42, !183}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "bpf_timer_set_callback", scope: !20, file: !161, line: 4007, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!43, !310, !42}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "____fmt", scope: !318, file: !3, line: 138, type: !247, isLocal: true, isDefinition: true)
!318 = distinct !DISubprogram(name: "timer_callback", scope: !3, file: !3, line: 137, type: !319, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !321)
!319 = !DISubroutineType(types: !320)
!320 = !{!6, !42, !84, !133}
!321 = !{!322, !323, !324, !325, !326}
!322 = !DILocalVariable(name: "map", arg: 1, scope: !318, file: !3, line: 137, type: !42)
!323 = !DILocalVariable(name: "fid", arg: 2, scope: !318, file: !3, line: 137, type: !84)
!324 = !DILocalVariable(name: "val", arg: 3, scope: !318, file: !3, line: 137, type: !133)
!325 = !DILocalVariable(name: "te", scope: !318, file: !3, line: 139, type: !150)
!326 = !DILocalVariable(name: "i", scope: !318, file: !3, line: 144, type: !6)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "____fmt", scope: !318, file: !3, line: 146, type: !247, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "bpf_timer_start", scope: !20, file: !161, line: 4043, type: !331, isLocal: true, isDefinition: true)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!43, !310, !183, !183}
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 241, type: !232, isLocal: true, isDefinition: true)
!336 = distinct !DISubprogram(name: "net_event_processor", scope: !3, file: !3, line: 235, type: !337, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !209}
!339 = !{!340, !341, !342, !343, !344, !345}
!340 = !DILocalVariable(name: "ne", arg: 1, scope: !336, file: !3, line: 235, type: !209)
!341 = !DILocalVariable(name: "tcp_ctx", scope: !336, file: !3, line: 237, type: !93)
!342 = !DILocalVariable(name: "map_entry", scope: !336, file: !3, line: 244, type: !133)
!343 = !DILocalVariable(name: "data_rest", scope: !336, file: !3, line: 252, type: !6)
!344 = !DILocalVariable(name: "num_to_send", scope: !336, file: !3, line: 259, type: !6)
!345 = !DILocalVariable(name: "i", scope: !336, file: !3, line: 266, type: !6)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 246, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 20)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 251, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 136, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 17)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 254, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 240, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 30)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 268, type: !252, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 273, type: !247, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "____fmt", scope: !336, file: !3, line: 277, type: !259, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "bpf_timer_cancel", scope: !20, file: !161, line: 4057, type: !369, isLocal: true, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!43, !310}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "____fmt", scope: !374, file: !3, line: 217, type: !232, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "update_window", scope: !3, file: !3, line: 214, type: !270, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DILocalVariable(name: "index", arg: 1, scope: !374, file: !3, line: 214, type: !12)
!377 = !DILocalVariable(name: "fid", arg: 2, scope: !374, file: !3, line: 214, type: !84)
!378 = !DILocalVariable(name: "tcp_ctx", scope: !374, file: !3, line: 215, type: !93)
!379 = !DILocalVariable(name: "pe", scope: !374, file: !3, line: 224, type: !121)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "____fmt", scope: !382, file: !3, line: 117, type: !287, isLocal: true, isDefinition: true)
!382 = distinct !DISubprogram(name: "deque", scope: !3, file: !3, line: 114, type: !383, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!6, !84}
!385 = !{!386, !387, !388}
!386 = !DILocalVariable(name: "fid", arg: 1, scope: !382, file: !3, line: 114, type: !84)
!387 = !DILocalVariable(name: "tcp_ctx", scope: !382, file: !3, line: 115, type: !93)
!388 = !DILocalVariable(name: "pe", scope: !382, file: !3, line: 126, type: !120)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "____fmt", scope: !382, file: !3, line: 122, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 368, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 46)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "____fmt", scope: !382, file: !3, line: 128, type: !237, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "____fmt", scope: !398, file: !3, line: 313, type: !408, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "resend_packet", scope: !3, file: !3, line: 310, type: !399, scopeLine: 310, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !85}
!401 = !{!402, !403, !404, !405}
!402 = !DILocalVariable(name: "fid", arg: 1, scope: !398, file: !3, line: 310, type: !85)
!403 = !DILocalVariable(name: "te", scope: !398, file: !3, line: 311, type: !149)
!404 = !DILocalVariable(name: "tcp_ctx", scope: !398, file: !3, line: 316, type: !93)
!405 = !DILocalVariable(name: "pe", scope: !406, file: !3, line: 322, type: !120)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 321, column: 50)
!407 = distinct !DILexicalBlock(scope: !398, file: !3, line: 321, column: 8)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 320, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 40)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "____fmt", scope: !398, file: !3, line: 318, type: !56, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "____fmt", scope: !398, file: !3, line: 324, type: !214, isLocal: true, isDefinition: true)
!415 = !{!416, !417, !418, !419, !420, !433, !462, !484, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!416 = !DILocalVariable(name: "ctx", arg: 1, scope: !2, file: !3, line: 332, type: !7)
!417 = !DILocalVariable(name: "data_end", scope: !2, file: !3, line: 335, type: !42)
!418 = !DILocalVariable(name: "data", scope: !2, file: !3, line: 336, type: !42)
!419 = !DILocalVariable(name: "cpu", scope: !2, file: !3, line: 337, type: !6)
!420 = !DILocalVariable(name: "eth", scope: !2, file: !3, line: 340, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !423, line: 168, size: 112, elements: !424)
!423 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!424 = !{!425, !429, !430}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !422, file: !423, line: 169, baseType: !426, size: 48)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 48, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 6)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !422, file: !423, line: 170, baseType: !426, size: 48, offset: 48)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !422, file: !423, line: 171, baseType: !431, size: 16, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !432, line: 25, baseType: !44)
!432 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!433 = !DILocalVariable(name: "iphdr", scope: !2, file: !3, line: 341, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !436, line: 87, size: 160, elements: !437)
!436 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !448}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !435, file: !436, line: 89, baseType: !194, size: 4, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !435, file: !436, line: 90, baseType: !194, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !435, file: !436, line: 97, baseType: !194, size: 8, offset: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !435, file: !436, line: 98, baseType: !431, size: 16, offset: 16)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !435, file: !436, line: 99, baseType: !431, size: 16, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !435, file: !436, line: 100, baseType: !431, size: 16, offset: 48)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !435, file: !436, line: 101, baseType: !194, size: 8, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !435, file: !436, line: 102, baseType: !194, size: 8, offset: 72)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !435, file: !436, line: 103, baseType: !447, size: 16, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !432, line: 31, baseType: !44)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 104, baseType: !449, size: 64, offset: 96)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 104, size: 64, elements: !450)
!450 = !{!451, !457}
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !449, file: !436, line: 104, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !436, line: 104, size: 64, elements: !453)
!453 = !{!454, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !452, file: !436, line: 104, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !432, line: 27, baseType: !12)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !452, file: !436, line: 104, baseType: !455, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !449, file: !436, line: 104, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !436, line: 104, size: 64, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !458, file: !436, line: 104, baseType: !455, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !458, file: !436, line: 104, baseType: !455, size: 32, offset: 32)
!462 = !DILocalVariable(name: "tcphdr", scope: !2, file: !3, line: 342, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !465, line: 25, size: 160, elements: !466)
!465 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !464, file: !465, line: 26, baseType: !431, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !464, file: !465, line: 27, baseType: !431, size: 16, offset: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !464, file: !465, line: 28, baseType: !455, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !464, file: !465, line: 29, baseType: !455, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !464, file: !465, line: 31, baseType: !44, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !464, file: !465, line: 32, baseType: !44, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !464, file: !465, line: 33, baseType: !44, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !464, file: !465, line: 34, baseType: !44, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !464, file: !465, line: 35, baseType: !44, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !464, file: !465, line: 36, baseType: !44, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !464, file: !465, line: 37, baseType: !44, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !464, file: !465, line: 38, baseType: !44, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !464, file: !465, line: 39, baseType: !44, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !464, file: !465, line: 40, baseType: !44, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !464, file: !465, line: 55, baseType: !431, size: 16, offset: 112)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !464, file: !465, line: 56, baseType: !447, size: 16, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !464, file: !465, line: 57, baseType: !431, size: 16, offset: 144)
!484 = !DILocalVariable(name: "nh", scope: !2, file: !3, line: 343, type: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !486, line: 33, size: 64, elements: !487)
!486 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processor", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !485, file: !486, line: 34, baseType: !42, size: 64)
!489 = !DILocalVariable(name: "fid", scope: !2, file: !3, line: 346, type: !85)
!490 = !DILocalVariable(name: "iph", scope: !2, file: !3, line: 354, type: !434)
!491 = !DILocalVariable(name: "hdrsize", scope: !2, file: !3, line: 355, type: !6)
!492 = !DILocalVariable(name: "id", scope: !2, file: !3, line: 368, type: !44)
!493 = !DILocalVariable(name: "len", scope: !2, file: !3, line: 375, type: !6)
!494 = !DILocalVariable(name: "h", scope: !2, file: !3, line: 376, type: !463)
!495 = !DILocalVariable(name: "ack", scope: !2, file: !3, line: 391, type: !12)
!496 = !DILocalVariable(name: "e", scope: !2, file: !3, line: 395, type: !191)
!497 = !DILocalVariable(name: "ne", scope: !2, file: !3, line: 396, type: !210)
!498 = !DILocalVariable(name: "ae", scope: !2, file: !3, line: 397, type: !203)
!499 = !DILocalVariable(name: "reverse_fid", scope: !2, file: !3, line: 402, type: !85)
!500 = !DILocalVariable(name: "tcp_ctx", scope: !501, file: !3, line: 411, type: !93)
!501 = distinct !DILexicalBlock(scope: !502, file: !3, line: 410, column: 18)
!502 = distinct !DILexicalBlock(scope: !2, file: !3, line: 410, column: 9)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 24, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 3)
!506 = !{i32 7, !"Dwarf Version", i32 5}
!507 = !{i32 2, !"Debug Info Version", i32 3}
!508 = !{i32 1, !"wchar_size", i32 4}
!509 = !{i32 7, !"frame-pointer", i32 2}
!510 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!511 = !DILocation(line: 0, scope: !2)
!512 = !DILocation(line: 335, column: 41, scope: !2)
!513 = !{!514, !515, i64 4}
!514 = !{!"xdp_md", !515, i64 0, !515, i64 4, !515, i64 8, !515, i64 12, !515, i64 16, !515, i64 20}
!515 = !{!"int", !516, i64 0}
!516 = !{!"omnipotent char", !517, i64 0}
!517 = !{!"Simple C/C++ TBAA"}
!518 = !DILocation(line: 335, column: 30, scope: !2)
!519 = !DILocation(line: 335, column: 22, scope: !2)
!520 = !DILocation(line: 336, column: 37, scope: !2)
!521 = !{!514, !515, i64 0}
!522 = !DILocation(line: 336, column: 26, scope: !2)
!523 = !DILocation(line: 336, column: 18, scope: !2)
!524 = !DILocation(line: 337, column: 15, scope: !2)
!525 = !DILocation(line: 338, column: 5, scope: !526)
!526 = distinct !DILexicalBlock(scope: !2, file: !3, line: 338, column: 5)
!527 = !DILocalVariable(name: "nh", arg: 1, scope: !528, file: !3, line: 299, type: !531)
!528 = distinct !DISubprogram(name: "parse_ethhdr_new", scope: !3, file: !3, line: 299, type: !529, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !20, retainedNodes: !533)
!529 = !DISubroutineType(types: !530)
!530 = !{!6, !531, !42, !532}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!533 = !{!527, !534, !535, !536, !537}
!534 = !DILocalVariable(name: "data_end", arg: 2, scope: !528, file: !3, line: 299, type: !42)
!535 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !528, file: !3, line: 299, type: !532)
!536 = !DILocalVariable(name: "eth", scope: !528, file: !3, line: 301, type: !421)
!537 = !DILocalVariable(name: "hdrsize", scope: !528, file: !3, line: 302, type: !6)
!538 = !DILocation(line: 0, scope: !528, inlinedAt: !539)
!539 = distinct !DILocation(line: 350, column: 5, scope: !2)
