; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [1 x i32]*, [32 x i32]*, %struct.flow_id*, %struct.tcp_md* }
%struct.flow_id = type { i32, i16, i32, i16 }
%struct.tcp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { [2 x i32]*, [5 x i32]*, i32*, %struct.packet_event* }
%struct.packet_event = type { %struct.flow_id, i32, i8, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.net_event = type { %struct.flow_id, i32 }
%struct.app_event = type { %struct.flow_id, i8*, i8*, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.event = type { i8, i8* }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@tcp_connections = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !25
@window_packets = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !61
@app_event_processor.____fmt = internal constant [38 x i8] c"\0Atcp_ctx does not exist with the fid\0A\00", align 1, !dbg !121
@enque.____fmt = internal constant [37 x i8] c"\0Atcp_ctx does not exist with the fid\00", align 1, !dbg !145

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 308, type: !224, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event_type", file: !3, line: 16, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "APP_EVENT", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "PACKET_EVENT", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "NET_EVENT", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !12, line: 3150, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!19 = !{!20, !21, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !6)
!23 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!24 = !{!0, !25, !61, !86, !121, !137, !145, !158, !163, !170, !179, !187, !192, !198, !212, !214, !219}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "tcp_connections", scope: !2, file: !3, line: 52, type: !27, isLocal: false, isDefinition: true)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 46, size: 256, elements: !28)
!28 = !{!29, !35, !40, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !3, line: 48, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !33)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34}
!34 = !DISubrange(count: 1)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !27, file: !3, line: 49, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !27, file: !3, line: 50, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_id", file: !43, line: 3, size: 128, elements: !44)
!43 = !DIFile(filename: "./common.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!44 = !{!45, !46, !49, !50}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sender_ip", scope: !42, file: !43, line: 4, baseType: !22, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sender_port", scope: !42, file: !43, line: 5, baseType: !47, size: 16, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !23, line: 24, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_ip", scope: !42, file: !43, line: 6, baseType: !22, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_port", scope: !42, file: !43, line: 7, baseType: !47, size: 16, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !27, file: !3, line: 51, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_md", file: !43, line: 10, size: 192, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "segment_size", scope: !53, file: !43, line: 12, baseType: !22, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !53, file: !43, line: 14, baseType: !22, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "window_start_seq", scope: !53, file: !43, line: 16, baseType: !22, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "last_seq_sent", scope: !53, file: !43, line: 18, baseType: !22, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !53, file: !43, line: 22, baseType: !22, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cur_size", scope: !53, file: !43, line: 24, baseType: !22, size: 32, offset: 160)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "window_packets", scope: !2, file: !3, line: 60, type: !63, isLocal: false, isDefinition: true)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 54, size: 256, elements: !64)
!64 = !{!65, !70, !75, !77}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !3, line: 56, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 2)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !3, line: 57, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 5)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !63, file: !3, line: 58, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !63, file: !3, line: 59, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_event", file: !3, line: 34, size: 224, elements: !80)
!80 = !{!81, !82, !83, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !79, file: !3, line: 35, baseType: !42, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !79, file: !3, line: 36, baseType: !32, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !3, line: 37, baseType: !84, size: 8, offset: 160)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !3, line: 38, baseType: !22, size: 32, offset: 192)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "____fmt", scope: !88, file: !3, line: 202, type: !117, isLocal: true, isDefinition: true)
!88 = distinct !DISubprogram(name: "dispatcher", scope: !3, file: !3, line: 189, type: !89, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !98)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !3, line: 41, size: 128, elements: !93)
!93 = !{!94, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !3, line: 42, baseType: !95, size: 8)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !96)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "event_data", scope: !92, file: !3, line: 43, baseType: !20, size: 64, offset: 64)
!98 = !{!99, !100, !110}
!99 = !DILocalVariable(name: "event", arg: 1, scope: !88, file: !3, line: 189, type: !91)
!100 = !DILocalVariable(name: "ae", scope: !101, file: !3, line: 192, type: !103)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 191, column: 25)
!102 = distinct !DILexicalBlock(scope: !88, file: !3, line: 190, column: 26)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_event", file: !3, line: 22, size: 320, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !104, file: !3, line: 23, baseType: !42, size: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !3, line: 24, baseType: !20, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !104, file: !3, line: 25, baseType: !20, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !3, line: 26, baseType: !22, size: 32, offset: 256)
!110 = !DILocalVariable(name: "ne", scope: !111, file: !3, line: 197, type: !112)
!111 = distinct !DILexicalBlock(scope: !102, file: !3, line: 196, column: 25)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_event", file: !3, line: 29, size: 160, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !113, file: !3, line: 30, baseType: !42, size: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !113, file: !3, line: 31, baseType: !22, size: 32, offset: 128)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 192, elements: !119)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!119 = !{!120}
!120 = !DISubrange(count: 24)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "____fmt", scope: !123, file: !3, line: 122, type: !134, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "app_event_processor", scope: !3, file: !3, line: 118, type: !124, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !103}
!126 = !{!127, !128, !129, !131}
!127 = !DILocalVariable(name: "ae", arg: 1, scope: !123, file: !3, line: 118, type: !103)
!128 = !DILocalVariable(name: "tcp_ctx", scope: !123, file: !3, line: 120, type: !52)
!129 = !DILocalVariable(name: "i", scope: !130, file: !3, line: 125, type: !32)
!130 = distinct !DILexicalBlock(scope: !123, file: !3, line: 125, column: 5)
!131 = !DILocalVariable(name: "pe", scope: !132, file: !3, line: 126, type: !79)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 125, column: 43)
!133 = distinct !DILexicalBlock(scope: !130, file: !3, line: 125, column: 5)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 304, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 38)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !139, line: 56, type: !140, isLocal: true, isDefinition: true)
!139 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!20, !20, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "____fmt", scope: !147, file: !3, line: 65, type: !155, isLocal: true, isDefinition: true)
!147 = distinct !DISubprogram(name: "enque", scope: !3, file: !3, line: 62, type: !148, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{!32, !78, !41}
!150 = !{!151, !152, !153, !154}
!151 = !DILocalVariable(name: "p", arg: 1, scope: !147, file: !3, line: 62, type: !78)
!152 = !DILocalVariable(name: "fid", arg: 2, scope: !147, file: !3, line: 62, type: !41)
!153 = !DILocalVariable(name: "tcp_ctx", scope: !147, file: !3, line: 63, type: !52)
!154 = !DILocalVariable(name: "key", scope: !147, file: !3, line: 74, type: !22)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 296, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 37)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "____fmt", scope: !147, file: !3, line: 70, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 376, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 47)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !139, line: 78, type: !165, isLocal: true, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!21, !20, !143, !143, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !23, line: 31, baseType: !169)
!169 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "____fmt", scope: !172, file: !3, line: 149, type: !134, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "net_event_processor", scope: !3, file: !3, line: 137, type: !173, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !175)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !112}
!175 = !{!176, !177, !178}
!176 = !DILocalVariable(name: "ne", arg: 1, scope: !172, file: !3, line: 137, type: !112)
!177 = !DILocalVariable(name: "fid", scope: !172, file: !3, line: 139, type: !42)
!178 = !DILocalVariable(name: "tcp_ctx", scope: !172, file: !3, line: 145, type: !52)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "____fmt", scope: !181, file: !3, line: 84, type: !155, isLocal: true, isDefinition: true)
!181 = distinct !DISubprogram(name: "deque", scope: !3, file: !3, line: 81, type: !182, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !184)
!182 = !DISubroutineType(types: !183)
!183 = !{!32, !41}
!184 = !{!185, !186}
!185 = !DILocalVariable(name: "fid", arg: 1, scope: !181, file: !3, line: 81, type: !41)
!186 = !DILocalVariable(name: "tcp_ctx", scope: !181, file: !3, line: 82, type: !52)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "____fmt", scope: !181, file: !3, line: 89, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 368, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 46)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !139, line: 177, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!21, !197, !22, null}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "____fmt", scope: !200, file: !3, line: 102, type: !155, isLocal: true, isDefinition: true)
!200 = distinct !DISubprogram(name: "display", scope: !3, file: !3, line: 99, type: !201, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !203)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !41}
!203 = !{!204, !205, !206, !208, !211}
!204 = !DILocalVariable(name: "fid", arg: 1, scope: !200, file: !3, line: 99, type: !41)
!205 = !DILocalVariable(name: "tcp_ctx", scope: !200, file: !3, line: 100, type: !52)
!206 = !DILocalVariable(name: "i", scope: !207, file: !3, line: 106, type: !32)
!207 = distinct !DILexicalBlock(scope: !200, file: !3, line: 106, column: 5)
!208 = !DILocalVariable(name: "key", scope: !209, file: !3, line: 108, type: !22)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 106, column: 42)
!210 = distinct !DILexicalBlock(scope: !207, file: !3, line: 106, column: 5)
!211 = !DILocalVariable(name: "pe", scope: !209, file: !3, line: 109, type: !78)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "____fmt", scope: !200, file: !3, line: 105, type: !117, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "____fmt", scope: !200, file: !3, line: 111, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 208, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 26)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "____fmt", scope: !200, file: !3, line: 114, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 96, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 12)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 4)
!227 = !{i32 7, !"Dwarf Version", i32 4}
!228 = !{i32 2, !"Debug Info Version", i32 3}
!229 = !{i32 1, !"wchar_size", i32 4}
!230 = !{!"clang version 10.0.0-4ubuntu1 "}
!231 = distinct !DISubprogram(name: "simply_drop", scope: !3, file: !3, line: 221, type: !232, scopeLine: 222, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!232 = !DISubroutineType(types: !233)
!233 = !{!32, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !12, line: 3161, size: 160, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !12, line: 3162, baseType: !22, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !235, file: !12, line: 3163, baseType: !22, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !235, file: !12, line: 3164, baseType: !22, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !235, file: !12, line: 3166, baseType: !22, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !235, file: !12, line: 3167, baseType: !22, size: 32, offset: 128)
!242 = !{!243, !244, !245, !246, !259, !277, !299, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!243 = !DILocalVariable(name: "ctx", arg: 1, scope: !231, file: !3, line: 221, type: !234)
!244 = !DILocalVariable(name: "data_end", scope: !231, file: !3, line: 225, type: !20)
!245 = !DILocalVariable(name: "data", scope: !231, file: !3, line: 226, type: !20)
!246 = !DILocalVariable(name: "eth", scope: !231, file: !3, line: 229, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !249, line: 163, size: 112, elements: !250)
!249 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!250 = !{!251, !255, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !248, file: !249, line: 164, baseType: !252, size: 48)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 6)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !248, file: !249, line: 165, baseType: !252, size: 48, offset: 48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !248, file: !249, line: 166, baseType: !257, size: 16, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !258, line: 25, baseType: !47)
!258 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!259 = !DILocalVariable(name: "iphdr", scope: !231, file: !3, line: 230, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !262, line: 86, size: 160, elements: !263)
!262 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !274, !276}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !261, file: !262, line: 88, baseType: !95, size: 4, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !261, file: !262, line: 89, baseType: !95, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !261, file: !262, line: 96, baseType: !95, size: 8, offset: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !261, file: !262, line: 97, baseType: !257, size: 16, offset: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !261, file: !262, line: 98, baseType: !257, size: 16, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !261, file: !262, line: 99, baseType: !257, size: 16, offset: 48)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !261, file: !262, line: 100, baseType: !95, size: 8, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !261, file: !262, line: 101, baseType: !95, size: 8, offset: 72)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !261, file: !262, line: 102, baseType: !273, size: 16, offset: 80)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !258, line: 31, baseType: !47)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !261, file: !262, line: 103, baseType: !275, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !258, line: 27, baseType: !22)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !261, file: !262, line: 104, baseType: !275, size: 32, offset: 128)
!277 = !DILocalVariable(name: "tcphdr", scope: !231, file: !3, line: 231, type: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !280, line: 25, size: 160, elements: !281)
!280 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !279, file: !280, line: 26, baseType: !257, size: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !279, file: !280, line: 27, baseType: !257, size: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !279, file: !280, line: 28, baseType: !275, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !279, file: !280, line: 29, baseType: !275, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !279, file: !280, line: 31, baseType: !47, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !279, file: !280, line: 32, baseType: !47, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !279, file: !280, line: 33, baseType: !47, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !279, file: !280, line: 34, baseType: !47, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !279, file: !280, line: 35, baseType: !47, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !279, file: !280, line: 36, baseType: !47, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !279, file: !280, line: 37, baseType: !47, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !279, file: !280, line: 38, baseType: !47, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !279, file: !280, line: 39, baseType: !47, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !279, file: !280, line: 40, baseType: !47, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !279, file: !280, line: 55, baseType: !257, size: 16, offset: 112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !279, file: !280, line: 56, baseType: !273, size: 16, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !279, file: !280, line: 57, baseType: !257, size: 16, offset: 144)
!299 = !DILocalVariable(name: "nh", scope: !231, file: !3, line: 232, type: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !301, line: 33, size: 64, elements: !302)
!301 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !300, file: !301, line: 34, baseType: !20, size: 64)
!304 = !DILocalVariable(name: "fid", scope: !231, file: !3, line: 235, type: !42)
!305 = !DILocalVariable(name: "iph", scope: !231, file: !3, line: 243, type: !260)
!306 = !DILocalVariable(name: "hdrsize", scope: !231, file: !3, line: 244, type: !32)
!307 = !DILocalVariable(name: "len", scope: !231, file: !3, line: 259, type: !32)
!308 = !DILocalVariable(name: "h", scope: !231, file: !3, line: 260, type: !278)
!309 = !DILocalVariable(name: "ack", scope: !231, file: !3, line: 275, type: !22)
!310 = !DILocalVariable(name: "e", scope: !231, file: !3, line: 279, type: !92)
!311 = !DILocalVariable(name: "ne", scope: !231, file: !3, line: 280, type: !113)
!312 = !DILocalVariable(name: "ae", scope: !231, file: !3, line: 281, type: !104)
!313 = !DILocation(line: 139, column: 20, scope: !172, inlinedAt: !314)
!314 = distinct !DILocation(line: 198, column: 13, scope: !111, inlinedAt: !315)
!315 = distinct !DILocation(line: 303, column: 5, scope: !231)
!316 = !DILocation(line: 126, column: 29, scope: !132, inlinedAt: !317)
!317 = distinct !DILocation(line: 193, column: 13, scope: !101, inlinedAt: !315)
!318 = !DILocation(line: 0, scope: !231)
!319 = !DILocation(line: 225, column: 41, scope: !231)
!320 = !{!321, !322, i64 4}
!321 = !{!"xdp_md", !322, i64 0, !322, i64 4, !322, i64 8, !322, i64 12, !322, i64 16}
!322 = !{!"int", !323, i64 0}
!323 = !{!"omnipotent char", !324, i64 0}
!324 = !{!"Simple C/C++ TBAA"}
!325 = !DILocation(line: 225, column: 30, scope: !231)
!326 = !DILocation(line: 225, column: 22, scope: !231)
!327 = !DILocation(line: 226, column: 37, scope: !231)
!328 = !{!321, !322, i64 0}
!329 = !DILocation(line: 226, column: 26, scope: !231)
!330 = !DILocation(line: 226, column: 18, scope: !231)
!331 = !DILocation(line: 235, column: 5, scope: !231)
!332 = !DILocation(line: 235, column: 20, scope: !231)
!333 = !DILocation(line: 236, column: 5, scope: !231)
!334 = !DILocalVariable(name: "nh", arg: 1, scope: !335, file: !3, line: 207, type: !338)
!335 = distinct !DISubprogram(name: "parse_ethhdr_new", scope: !3, file: !3, line: 207, type: !336, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !340)
!336 = !DISubroutineType(types: !337)
!337 = !{!32, !338, !20, !339}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!340 = !{!334, !341, !342, !343, !344}
!341 = !DILocalVariable(name: "data_end", arg: 2, scope: !335, file: !3, line: 207, type: !20)
!342 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !335, file: !3, line: 207, type: !339)
!343 = !DILocalVariable(name: "eth", scope: !335, file: !3, line: 209, type: !247)
!344 = !DILocalVariable(name: "hdrsize", scope: !335, file: !3, line: 210, type: !32)
!345 = !DILocation(line: 0, scope: !335, inlinedAt: !346)
!346 = distinct !DILocation(line: 239, column: 5, scope: !231)
!347 = !DILocation(line: 211, column: 14, scope: !348, inlinedAt: !346)
!348 = distinct !DILexicalBlock(scope: !335, file: !3, line: 211, column: 6)
!349 = !DILocation(line: 211, column: 24, scope: !348, inlinedAt: !346)
!350 = !DILocation(line: 213, column: 10, scope: !335, inlinedAt: !346)
!351 = !DILocation(line: 211, column: 6, scope: !335, inlinedAt: !346)
!352 = !DILocation(line: 243, column: 28, scope: !231)
