; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [1 x i32]*, [32 x i32]*, %struct.flow_id*, %struct.tcp_md* }
%struct.flow_id = type { i32, i16, i32, i16 }
%struct.tcp_md = type { i32, i32, i32, i32, i32 }
%struct.anon.0 = type { [2 x i32]*, [32 x i32]*, i32*, %struct.packet_event* }
%struct.packet_event = type { %struct.flow_id, i32, i8, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.app_event = type { %struct.flow_id, i8*, i8*, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.hdr_cursor = type { i8* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.event = type { i8, i8* }
%struct.net_event = type { %struct.flow_id, i32 }

@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !0
@tcp_connections = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !25
@packet_events = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !60
@app_event_processor.____fmt = internal constant [38 x i8] c"\0Atcp_ctx does not exist with the fid\0A\00", align 1, !dbg !116
@app_event_processor.____fmt.1 = internal constant [38 x i8] c"\0AFailed to add packet with seq_num %u\00", align 1, !dbg !133

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 279, type: !200, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "event_type", file: !3, line: 16, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "APP_EVENT", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "PACKET_EVENT", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "NET_EVENT", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !12, line: 3150, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!19 = !{!20, !21, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !6)
!23 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!24 = !{!0, !25, !60, !81, !116, !133, !135, !140, !145, !153, !160, !178, !180, !185, !187, !189, !194}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "tcp_connections", scope: !2, file: !3, line: 52, type: !27, isLocal: false, isDefinition: true)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 46, size: 256, elements: !28)
!28 = !{!29, !35, !40, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !3, line: 48, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !33)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34}
!34 = !DISubrange(count: 1)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !27, file: !3, line: 49, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !27, file: !3, line: 50, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_id", file: !43, line: 3, size: 128, elements: !44)
!43 = !DIFile(filename: "./common.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!44 = !{!45, !46, !49, !50}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sender_ip", scope: !42, file: !43, line: 4, baseType: !22, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sender_port", scope: !42, file: !43, line: 5, baseType: !47, size: 16, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !23, line: 24, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_ip", scope: !42, file: !43, line: 6, baseType: !22, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "receiver_port", scope: !42, file: !43, line: 7, baseType: !47, size: 16, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !27, file: !3, line: 51, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_md", file: !43, line: 10, size: 160, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "segment_size", scope: !53, file: !43, line: 11, baseType: !22, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "current_size", scope: !53, file: !43, line: 12, baseType: !22, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "initial_seq", scope: !53, file: !43, line: 13, baseType: !22, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "window_start_seq", scope: !53, file: !43, line: 14, baseType: !22, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last_seq_sent", scope: !53, file: !43, line: 15, baseType: !22, size: 32, offset: 128)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "packet_events", scope: !2, file: !3, line: 60, type: !62, isLocal: false, isDefinition: true)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 54, size: 256, elements: !63)
!63 = !{!64, !69, !70, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !3, line: 56, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 2)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !62, file: !3, line: 57, baseType: !36, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !62, file: !3, line: 58, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !62, file: !3, line: 59, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_event", file: !3, line: 34, size: 224, elements: !75)
!75 = !{!76, !77, !78, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !74, file: !3, line: 35, baseType: !42, size: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !74, file: !3, line: 36, baseType: !32, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !3, line: 37, baseType: !79, size: 8, offset: 160)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !74, file: !3, line: 38, baseType: !22, size: 32, offset: 192)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "____fmt", scope: !83, file: !3, line: 186, type: !112, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "dispatcher", scope: !3, file: !3, line: 173, type: !84, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !3, line: 41, size: 128, elements: !88)
!88 = !{!89, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !3, line: 42, baseType: !90, size: 8)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !91)
!91 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "event_data", scope: !87, file: !3, line: 43, baseType: !20, size: 64, offset: 64)
!93 = !{!94, !95, !105}
!94 = !DILocalVariable(name: "event", arg: 1, scope: !83, file: !3, line: 173, type: !86)
!95 = !DILocalVariable(name: "ae", scope: !96, file: !3, line: 176, type: !98)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 175, column: 25)
!97 = distinct !DILexicalBlock(scope: !83, file: !3, line: 174, column: 26)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_event", file: !3, line: 22, size: 320, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !99, file: !3, line: 23, baseType: !42, size: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !3, line: 24, baseType: !20, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !99, file: !3, line: 25, baseType: !20, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !99, file: !3, line: 26, baseType: !22, size: 32, offset: 256)
!105 = !DILocalVariable(name: "ne", scope: !106, file: !3, line: 181, type: !107)
!106 = distinct !DILexicalBlock(scope: !97, file: !3, line: 180, column: 25)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_event", file: !3, line: 29, size: 160, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !108, file: !3, line: 30, baseType: !42, size: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !108, file: !3, line: 31, baseType: !22, size: 32, offset: 128)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!114 = !{!115}
!115 = !DISubrange(count: 24)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "____fmt", scope: !118, file: !3, line: 79, type: !130, isLocal: true, isDefinition: true)
!118 = distinct !DISubprogram(name: "app_event_processor", scope: !3, file: !3, line: 75, type: !119, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !98}
!121 = !{!122, !123, !124, !126, !129}
!122 = !DILocalVariable(name: "ae", arg: 1, scope: !118, file: !3, line: 75, type: !98)
!123 = !DILocalVariable(name: "tcp_ctx", scope: !118, file: !3, line: 77, type: !52)
!124 = !DILocalVariable(name: "i", scope: !125, file: !3, line: 88, type: !32)
!125 = distinct !DILexicalBlock(scope: !118, file: !3, line: 88, column: 5)
!126 = !DILocalVariable(name: "pe", scope: !127, file: !3, line: 89, type: !74)
!127 = distinct !DILexicalBlock(scope: !128, file: !3, line: 88, column: 43)
!128 = distinct !DILexicalBlock(scope: !125, file: !3, line: 88, column: 5)
!129 = !DILocalVariable(name: "ret", scope: !127, file: !3, line: 94, type: !32)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 304, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 38)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "____fmt", scope: !118, file: !3, line: 96, type: !130, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "____fmt", scope: !118, file: !3, line: 104, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 296, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 37)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "____fmt", scope: !118, file: !3, line: 107, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 528, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 66)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !147, line: 56, type: !148, isLocal: true, isDefinition: true)
!147 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!20, !20, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !147, line: 78, type: !155, isLocal: true, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!21, !20, !151, !151, !158}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !23, line: 31, baseType: !159)
!159 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 123, type: !130, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "net_event_processor", scope: !3, file: !3, line: 111, type: !163, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !107}
!165 = !{!166, !167, !168, !169, !170, !171, !172, !174, !177}
!166 = !DILocalVariable(name: "ne", arg: 1, scope: !162, file: !3, line: 111, type: !107)
!167 = !DILocalVariable(name: "fid", scope: !162, file: !3, line: 113, type: !42)
!168 = !DILocalVariable(name: "tcp_ctx", scope: !162, file: !3, line: 119, type: !52)
!169 = !DILocalVariable(name: "current_start", scope: !162, file: !3, line: 126, type: !32)
!170 = !DILocalVariable(name: "ack", scope: !162, file: !3, line: 143, type: !32)
!171 = !DILocalVariable(name: "num_to_send", scope: !162, file: !3, line: 147, type: !32)
!172 = !DILocalVariable(name: "i", scope: !173, file: !3, line: 151, type: !32)
!173 = distinct !DILexicalBlock(scope: !162, file: !3, line: 151, column: 5)
!174 = !DILocalVariable(name: "pe", scope: !175, file: !3, line: 152, type: !74)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 151, column: 46)
!176 = distinct !DILexicalBlock(scope: !173, file: !3, line: 151, column: 5)
!177 = !DILocalVariable(name: "ret", scope: !175, file: !3, line: 157, type: !32)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 134, type: !130, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 137, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 392, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 49)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 159, type: !130, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 166, type: !137, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "____fmt", scope: !162, file: !3, line: 169, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 496, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 62)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !147, line: 177, type: !196, isLocal: true, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!21, !199, !22, null}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 4)
!203 = !{i32 7, !"Dwarf Version", i32 4}
!204 = !{i32 2, !"Debug Info Version", i32 3}
!205 = !{i32 1, !"wchar_size", i32 4}
!206 = !{!"clang version 10.0.0-4ubuntu1 "}
!207 = distinct !DISubprogram(name: "simply_drop", scope: !3, file: !3, line: 194, type: !208, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !218)
!208 = !DISubroutineType(types: !209)
!209 = !{!32, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !12, line: 3161, size: 160, elements: !212)
!212 = !{!213, !214, !215, !216, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !12, line: 3162, baseType: !22, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !211, file: !12, line: 3163, baseType: !22, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !211, file: !12, line: 3164, baseType: !22, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !211, file: !12, line: 3166, baseType: !22, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !211, file: !12, line: 3167, baseType: !22, size: 32, offset: 128)
!218 = !{!219, !220, !221, !222, !235, !253, !275, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!219 = !DILocalVariable(name: "ctx", arg: 1, scope: !207, file: !3, line: 194, type: !210)
!220 = !DILocalVariable(name: "data_end", scope: !207, file: !3, line: 198, type: !20)
!221 = !DILocalVariable(name: "data", scope: !207, file: !3, line: 199, type: !20)
!222 = !DILocalVariable(name: "eth", scope: !207, file: !3, line: 202, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !225, line: 163, size: 112, elements: !226)
!225 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!226 = !{!227, !231, !232}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !224, file: !225, line: 164, baseType: !228, size: 48)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 6)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !224, file: !225, line: 165, baseType: !228, size: 48, offset: 48)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !224, file: !225, line: 166, baseType: !233, size: 16, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !234, line: 25, baseType: !47)
!234 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!235 = !DILocalVariable(name: "iphdr", scope: !207, file: !3, line: 203, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !238, line: 86, size: 160, elements: !239)
!238 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !250, !252}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !237, file: !238, line: 88, baseType: !90, size: 4, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !237, file: !238, line: 89, baseType: !90, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !237, file: !238, line: 96, baseType: !90, size: 8, offset: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !237, file: !238, line: 97, baseType: !233, size: 16, offset: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !237, file: !238, line: 98, baseType: !233, size: 16, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !237, file: !238, line: 99, baseType: !233, size: 16, offset: 48)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !237, file: !238, line: 100, baseType: !90, size: 8, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !237, file: !238, line: 101, baseType: !90, size: 8, offset: 72)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !237, file: !238, line: 102, baseType: !249, size: 16, offset: 80)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !234, line: 31, baseType: !47)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !237, file: !238, line: 103, baseType: !251, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !234, line: 27, baseType: !22)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !237, file: !238, line: 104, baseType: !251, size: 32, offset: 128)
!253 = !DILocalVariable(name: "tcphdr", scope: !207, file: !3, line: 204, type: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !256, line: 25, size: 160, elements: !257)
!256 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !255, file: !256, line: 26, baseType: !233, size: 16)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !255, file: !256, line: 27, baseType: !233, size: 16, offset: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !255, file: !256, line: 28, baseType: !251, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !255, file: !256, line: 29, baseType: !251, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !255, file: !256, line: 31, baseType: !47, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !255, file: !256, line: 32, baseType: !47, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !255, file: !256, line: 33, baseType: !47, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !255, file: !256, line: 34, baseType: !47, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !255, file: !256, line: 35, baseType: !47, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !255, file: !256, line: 36, baseType: !47, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !255, file: !256, line: 37, baseType: !47, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !255, file: !256, line: 38, baseType: !47, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !255, file: !256, line: 39, baseType: !47, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !255, file: !256, line: 40, baseType: !47, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !255, file: !256, line: 55, baseType: !233, size: 16, offset: 112)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !255, file: !256, line: 56, baseType: !249, size: 16, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !255, file: !256, line: 57, baseType: !233, size: 16, offset: 144)
!275 = !DILocalVariable(name: "nh", scope: !207, file: !3, line: 205, type: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !277, line: 33, size: 64, elements: !278)
!277 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/a68lin/XDP-Tryouts/xdp/event-processors")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !276, file: !277, line: 34, baseType: !20, size: 64)
!280 = !DILocalVariable(name: "fid", scope: !207, file: !3, line: 208, type: !42)
!281 = !DILocalVariable(name: "iph", scope: !207, file: !3, line: 215, type: !236)
!282 = !DILocalVariable(name: "hdrsize", scope: !207, file: !3, line: 216, type: !32)
!283 = !DILocalVariable(name: "len", scope: !207, file: !3, line: 231, type: !32)
!284 = !DILocalVariable(name: "h", scope: !207, file: !3, line: 232, type: !254)
!285 = !DILocalVariable(name: "ack", scope: !207, file: !3, line: 247, type: !22)
!286 = !DILocalVariable(name: "e", scope: !207, file: !3, line: 251, type: !87)
!287 = !DILocalVariable(name: "ne", scope: !207, file: !3, line: 252, type: !108)
!288 = !DILocalVariable(name: "ae", scope: !207, file: !3, line: 253, type: !99)
!289 = !DILocation(line: 113, column: 20, scope: !162, inlinedAt: !290)
!290 = distinct !DILocation(line: 182, column: 13, scope: !106, inlinedAt: !291)
!291 = distinct !DILocation(line: 275, column: 5, scope: !207)
!292 = !DILocation(line: 152, column: 29, scope: !175, inlinedAt: !290)
!293 = !DILocation(line: 89, column: 29, scope: !127, inlinedAt: !294)
!294 = distinct !DILocation(line: 177, column: 13, scope: !96, inlinedAt: !291)
!295 = !DILocation(line: 0, scope: !207)
!296 = !DILocation(line: 198, column: 41, scope: !207)
!297 = !{!298, !299, i64 4}
!298 = !{!"xdp_md", !299, i64 0, !299, i64 4, !299, i64 8, !299, i64 12, !299, i64 16}
!299 = !{!"int", !300, i64 0}
!300 = !{!"omnipotent char", !301, i64 0}
!301 = !{!"Simple C/C++ TBAA"}
!302 = !DILocation(line: 198, column: 30, scope: !207)
!303 = !DILocation(line: 198, column: 22, scope: !207)
!304 = !DILocation(line: 199, column: 37, scope: !207)
!305 = !{!298, !299, i64 0}
!306 = !DILocation(line: 199, column: 26, scope: !207)
!307 = !DILocation(line: 199, column: 18, scope: !207)
!308 = !DILocalVariable(name: "nh", arg: 1, scope: !309, file: !3, line: 62, type: !312)
!309 = distinct !DISubprogram(name: "parse_ethhdr_new", scope: !3, file: !3, line: 62, type: !310, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !314)
!310 = !DISubroutineType(types: !311)
!311 = !{!32, !312, !20, !313}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!314 = !{!308, !315, !316, !317, !318}
!315 = !DILocalVariable(name: "data_end", arg: 2, scope: !309, file: !3, line: 63, type: !20)
!316 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !309, file: !3, line: 64, type: !313)
!317 = !DILocalVariable(name: "eth", scope: !309, file: !3, line: 66, type: !223)
!318 = !DILocalVariable(name: "hdrsize", scope: !309, file: !3, line: 67, type: !32)
!319 = !DILocation(line: 0, scope: !309, inlinedAt: !320)
!320 = distinct !DILocation(line: 211, column: 5, scope: !207)
!321 = !DILocation(line: 68, column: 14, scope: !322, inlinedAt: !320)
!322 = distinct !DILexicalBlock(scope: !309, file: !3, line: 68, column: 6)
!323 = !DILocation(line: 68, column: 24, scope: !322, inlinedAt: !320)
!324 = !DILocation(line: 70, column: 10, scope: !309, inlinedAt: !320)
!325 = !DILocation(line: 68, column: 6, scope: !309, inlinedAt: !320)
!326 = !DILocation(line: 215, column: 28, scope: !207)
!327 = !DILocation(line: 217, column: 10, scope: !328)
!328 = distinct !DILexicalBlock(scope: !207, file: !3, line: 217, column: 6)
